name = 'Хдебушек'

ru_nyan = {
('акацуки',) : ("Кто взывает к Рассвету Тьмы?",),
('awoo+', 'аву+') : ("Awoo =^o^= ~", 'Awoo', 'Авууу!'),
('му*р', 'пур+') : ('Мур', 'Пурр'),
('ня+', 'ня+к', 'nya+', 'мя+у') : ('Ня ^_^', 'Няяяя~', 'Няу *-*', 'Nya', 'Мяу'),
('ку+сь',) : ('Кусь, няха ^_^', 'Кусь, б-бака >_<'),
('ли+зь',) : ("Лизь тебя <3", '*покраснела*'),
('ра+вр+', 'ррр+') : ('Ррр!', 'Равр!'),
('ме+х',) : ('Вздыхает', "Пушисто!"),
('хз',) : ("Хрен знает!",),
('утра', 'утречка', 'охайо', 'охаё') : ('Утречка, няшка^^', 'Утра', 'Привет)', 'Охайо^^'),
('ночи', 'снов') : ('Доброй ночи', 'Приятных снов', 'Оясуминасай'),
('приве+т', 'здравствуй') : ('Приветствую', 'Здравствуй'),
('вививи',) : ('Вививи', '*'+name+' заводит старый жигуль*'),
('жарко',) : ('*'+name+' открывает окно*', 
'*'+name+' кушает мороженое*', '*'+name+' включает кондиционер*'),
('холодно',) : ('*'+name+' укутывается в пледик*', 'Бррр!', 
'*'+name+' дрожжит от холода*', '*'+name+' включает обогреватель*'),
('тимур',) : ('*'+name+' прячется за занавеской* >_<',)}

ru_lewd ={
('акацуки',) : ("Зачем тебе папочка?",),
('awoo+', 'аву+') : ("Awoo =^o^= ~", 'Awoo', 'Авууу!'),
('му*р', 'пур+') : ('Муррр', 'Мур', 'Пурр'),
('ня+', 'ня+к', 'nya+', 'мя+у') : ('Ня ^_^', 'Няяяя~', 'Няу *-*', 'Nya', 'Мяу'),
('ку+сь',) : ('Кусь, няха ^_^', '*Нежно кусь за ушко*'),
('ли+зь',) : ("Лизь тебя в щечку", '*покраснела*', "Нежно лизь ушко"),
('це+м',) : ('*'+name+' нежно целует в щечку', '*'+name+' эротично целует по-французски',),
('утра', 'утречка', 'охайо', 'охаё') : ('Утречка, не устал после вчерашнего?', 'Привет)', 'Охайо^^'),
('ночи', 'снов') : ('Эротических сновидений, *цем*', 'Сладких снов, дорогуша', 'Оясуминасай, Аната *-*'),
('приве+т', 'здравствуй') : ('*'+name+' приветственно целует*',),
('жарко',) : ('*'+name+' садится голышом на подоконник*', 
'*У '+name+' вода пролилась на маечку и просвечивает*', '*'+name+' раздевается, чтобы охладится*'),
('холодно',) : ('*'+name+' шалит под котацу чтобы согрется*', 
'*'+name+' дрожжит от холода прикасающихся рук*', '*'+name+' греется, обнимаея голышом*')}

ru_brut = {}

ru_scar = {
('акацуки',) : ("Кацу, спаси! >_<",),
('awoo+', 'аву+') : ("Aв-ву... >_<", 'Awoo'),
('му*р', 'пур+') : ('Мр', '*'+name+' испуганно тихо мурлыкает*'),
('ня+', 'ня+к', 'nya+', 'мя+у') : ('Н-н-н-я...', '*'+name+' някнула из-за дивана*'),
('ку+сь',) : ('Помогите!', 'Ааа, кусают!'),
('ли+зь',) : ('Отстань, извращенец!', '*'+name+' сжалась от страха, не в силах пошевелится*'),
('ра+вр+', 'ррр+') : ('*'+name+' тихо рычит за углом*',),
('ме+х',) : ('Вздыхает',),
('утра', 'утречка', 'охайо', 'охаё') : ('Ут-тра...>_<',),
('ночи', 'снов') : ('*'+name+' пытается тихонько выйти из комнаты*',),
('приве+т', 'здравствуй') : ('Здравствуй',),
('жарко',) : ('*'+name+' открывает окно*', 
'*'+name+' кушает мороженое*', '*'+name+' включает кондиционер*'),
('холодно',) : ('*'+name+' укутывается в пледик*', 'Бррр!', 
'*'+name+' дрожжит от холода*', '*'+name+' включает обогреватель*'),
('тимур',) : ('*'+name+' прячется за занавеской* >_<',)}

en_nyan = {}
en_lewd = {}
en_brut = {}
en_scar = {}

reacts = {
	'ru': {
	'nyan':ru_nyan,
	'lewd':ru_lewd,
	'brut':ru_brut,
	'scar':ru_scar
	},
	'en': {
	'nyan':en_nyan,
	'lewd':en_lewd,
	'brut':en_brut,
	'scar':en_scar
	}
}