service = {
	'rp_greet'		: 'Приветствие сохранено.',
	'cond'			: 'Ответчик: ',
	'lang'			: 'Язык: ',
	'ttsm'			: 'TTS: ',
	'nsfw'			: 'NSFW: ',
	'mood'			: 'Настроение: ',
	'greet'			: 'Приветствие: ',
	'greet_on'		: 'Приветствие включено.',
	'greet_off'		: 'Приветствие выключено.',
	'exit'			: 'Бот полностью выключен.',
	'rp_on'			: 'Ответчик для чата включен.',
	'rp_off'		: 'Ответчик для чата выключен.',
	'tts_on'		: 'Текст в речь включен.',
	'tts_off'		: 'Текст в речь выключен.',
	'nsfw_on'		: 'NSFW-режим включен.',
	'nsfw_off'		: 'NSFW-режим выключен.',
	'ch_lang'		: 'Язык изменен.',
	'er_leng'		: 'Ошибка изменения языка.',
	'ch_mood'		: 'Режим изменен.',
	'er_mood'		: 'Ошибка изменения режима.',
	'perm_er'		: 'Как будто я тебе позволю!',
	'rep_nps'		: 'Репутация Хдебушка: ',
	'rep_er'		: 'А ну-ка не накручвай!',
	'rep_up'		: ("'Репутация @'+usr_name+' повышена'"),
	'use_stats'		: 'Твоя статистика: ',
	'use_cond'		: 'Ответчик: ',
	'use_ship'		: 'Шиппер:',
	'user_rp_on'	: 'Личное реагирование включено.',
	'user_rp_off'	: 'Личное реагирование выключено.',
	'user_ship_on'	: 'Вы включены в списки поиска пар.',
	'user_ship_off'	: 'Вы исключены из списков поиска пар.',
	'karma_use'		: 'Твоя карма: ',
	'karma_for'		: 'Карма пользователя',
	'karma_err'		: 'Ошибка. Необходимо "ответить" на сообщение',
	'karma_ch'		: ("'Карма юзера '+user.usern+' изменена на '+n"),
	'count'			: 'Параметры чата: ',
	'nyanc'			: 'Няшность: ',
	'lewdc'			: 'Пошлость: ',
	'angrc'			: 'Злость: ',
	'scarc'			: 'Испуг: ',
	'zero'			: 'Счетчики обнулены',
	'helpe'			: """!exch № валюта-из валюта-в(или auto)
!exch add валюта - добавить валюту в auto
!exch del валюта - удалить валюту из auto
	""",
	'help'			: """!help - эта справка
!help exch - справка по курсам валют
!help admin - справка админ команд
!help config - справка настроек пользователя
!stats - показатели чата
!admins - админы чата
!karma - репутация cвоя
!karma - репутация пользователя (reply)
!tts "яз" - текст в речь
!rand "от" "до" - рандом в промежутке
!translate "яз" - перевести сообщ или реплай и:
!trans "яз" или !tl "яз" 
""",
	'help_admin'	: """!lang - изменить язык ответчика (ru, en)
!mood - изменить режим ответчика (nyan, lewd, brut, scar)
!greet - указать приветствие новому учаснику
!greet on/off - вкл/выкл приветствие
!cond on/off - вкл/выкл ответчик в чате
!nsfw on/off - вкл/выкл пошлый режим
!ttsm on/off - вкл/выкл текст-в-речь
!setkarma - установить карму пользователя (reply)
!set_zero - обнуляет счетчики настроения""",
	'help_usr_set'	: """!config cond on/off - вкл/выкл бота для себя
!config shipper on/off - вкл/выкл шиппер для себя
"""
}