service = {
	'rp_greet'		: 'Приветствие сохранено',
	'cond'			: 'Ответчик: ',
	'lang'			: 'Язык: ',
	'ttsm'			: 'TTS: ',
	'nsfw'			: 'NSFW: ',
	'mood'			: 'Настроение: ',
	'greet'			: 'Приветствие: ',
	'greet_on'		: 'Приветствие включено',
	'greet_off'		: 'Приветствие выключено',
	'exit'			: 'Бот полностью выключен',
	'rp_on'			: 'Ответчик для чата включен',
	'rp_off'		: 'Ответчик для чата выключен',
	'tts_on'		: 'Текст в речь включен',
	'tts_off'		: 'Текст в речь выключен',
	'nsfw_on'		: 'NSFW-режим включен',
	'nsfw_off'		: 'NSFW-режим выключен',
	'ch_lang'		: 'Язык изменен',
	'er_leng'		: 'Ошибка изменения языка',
	'ch_mood'		: 'Режим изменен',
	'er_mood'		: 'Ошибка изменения режима',
	'perm_er'		: 'Как будто я тебе позволю',
	'rep_nps'		: 'Репутация Хдебушка: ',
	'rep_er'		: 'А ну-ка не накручвай!',
	'rep_up'		: ("'Репутация '+usr_name+' повышена'"),
	'count'			: 'Параметры чата: ',
	'nyanc'			: 'Няшность: ',
	'lewdc'			: 'Пошлость: ',
	'angrc'			: 'Злость: ',
	'scarc'			: 'Испуг: ',
	'zero'			: 'Счетчики обнулены',
	'helpe'			: """!exch № валюта-из валюта-в(или auto)
	!exch add валюта - добавить валюту в auto
	!exch del валюта - удалить валюту из auto
	""",
	'help'			: """!help - эта справка
!help exch - справка по курсам валют
!help admin - справка админ команд
!stats - показатели чата
!mystat - репутация
!tts "яз" - текст в речь
!rand "от" "до" - рандом в промежутке
!translate "яз" - перевести сообщ или реплай и:
!trans "яз" или !tl "яз" 
""",
	'help_admin'	: """!lang - изменить язык ответчика (ru, en)
!mood - изменить режим ответчика (nyan, lewd, brut, scar)
!greet - указать приветствие новому учаснику
!cond on/off - вкл/выкл ответчик в чате
!ttsm on/off - вкл/выкл текст-в-речь
!set_zero - обнуляет счетчики настроения""",
}