def punto(lang, text, error):
    chars = {'@':'"','#':'№','$':';','^':':','&':'?',
            'q':'й','w':'ц','e':'у','r':'к','t':'е','y':'н','u':'г','i':'ш','o':'щ','p':'з','[':'х',']':'ъ',
            'a':'ф','s':'ы','d':'в','f':'а','g':'п','h':'р','j':'о','k':'л','l':'д',';':'ж','\'':'э',
            'z':'я','x':'ч','c':'с','v':'м','b':'и','n':'т','m':'ь',',':'б','.':'ю','/':'.', 
            'Q':'Й','W':'Ц','E':'У','R':'К','T':'Е','Y':'Н','U':'Г','I':'Ш','O':'Щ','P':'З','{':'Х','}':'Ъ',
            'A':'Ф','S':'Ы','D':'В','F':'А','G':'П','H':'Р','J':'О','K':'Л','L':'Д',':':'Ж','\"':'Э',
            'Z':'Я','X':'Ч','C':'С','V':'М','B':'И','N':'Т','M':'Ь','<':'Б','>':'Ю','?':',', }

    ntext = ''

    if lang == 'ru':
        for i in text:
            q = i
            for en, ru in chars.items():
                if i == en:
                    q = ru
            ntext = ntext + q
                
    elif lang == 'en':
        for i in text:
            q = i
            for en, ru in chars.items():
                if i == ru:
                    q = en
            ntext = ntext + q
    
    return ntext